yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162m8.h
#define MASK_RTC_CR3_ADD1H       0x01
#define MASK_RTC_CR3_SUB1H       0x02
#define MASK_RTC_CR3_BCK         0x04
#define MASK_RTC_CR3_POL         0x10
#define MASK_RTC_CR3_OSEL        0x60
#define MASK_RTC_CR3_COE         0x80

#define MASK_RTC_ISR1_ALRAWF     0x01
#define MASK_RTC_ISR1_RECALPF    0x02
#define MASK_RTC_ISR1_WUTWF      0x04
#define MASK_RTC_ISR1_SHPF       0x08
#define MASK_RTC_ISR1_INITS      0x10
#define MASK_RTC_ISR1_RSF        0x20
#define MASK_RTC_ISR1_INITF      0x40
#define MASK_RTC_ISR1_INIT       0x80

#define MASK_RTC_ISR2_ALRAF      0x01
#define MASK_RTC_ISR2_WUTF       0x04
#define MASK_RTC_ISR2_TAMP1F     0x20
#define MASK_RTC_ISR2_TAMP2F     0x40
#define MASK_RTC_ISR2_TAMP3F     0x80

#define MASK_RTC_SPRERH_PREDIV_S8 0x01
#define MASK_RTC_SPRERH_PREDIV_S9 0x02
#define MASK_RTC_SPRERH_PREDIV_S10 0x04
#define MASK_RTC_SPRERH_PREDIV_S11 0x08
#define MASK_RTC_SPRERH_PREDIV_S12 0x10
#define MASK_RTC_SPRERH_PREDIV_S13 0x20
#define MASK_RTC_SPRERH_PREDIV_S14 0x40

#define MASK_RTC_SPRERL_PREDIV_S0 0x01
#define MASK_RTC_SPRERL_PREDIV_S1 0x02
#define MASK_RTC_SPRERL_PREDIV_S2 0x04
#define MASK_RTC_SPRERL_PREDIV_S3 0x08
#define MASK_RTC_SPRERL_PREDIV_S4 0x10
#define MASK_RTC_SPRERL_PREDIV_S5 0x20
#define MASK_RTC_SPRERL_PREDIV_S6 0x40
#define MASK_RTC_SPRERL_PREDIV_S7 0x80

#define MASK_RTC_APRER_PREDIV_A  0x7F

#define MASK_RTC_WUTRH_WUT8      0x01
#define MASK_RTC_WUTRH_WUT9      0x02
#define MASK_RTC_WUTRH_WUT10     0x04
#define MASK_RTC_WUTRH_WUT11     0x08
#define MASK_RTC_WUTRH_WUT12     0x10
#define MASK_RTC_WUTRH_WUT13     0x20
#define MASK_RTC_WUTRH_WUT14     0x40
#define MASK_RTC_WUTRH_WUT15     0x80

#define MASK_RTC_WUTRL_WUT0      0x01
#define MASK_RTC_WUTRL_WUT1      0x02
#define MASK_RTC_WUTRL_WUT2      0x04
#define MASK_RTC_WUTRL_WUT3      0x08
#define MASK_RTC_WUTRL_WUT4      0x10
#define MASK_RTC_WUTRL_WUT5      0x20
#define MASK_RTC_WUTRL_WUT6      0x40
#define MASK_RTC_WUTRL_WUT7      0x80

#define MASK_RTC_SSRL_SS0        0x01
#define MASK_RTC_SSRL_SS1        0x02
#define MASK_RTC_SSRL_SS2        0x04
#define MASK_RTC_SSRL_SS3        0x08
#define MASK_RTC_SSRL_SS4        0x10
#define MASK_RTC_SSRL_SS5        0x20
#define MASK_RTC_SSRL_SS6        0x40
#define MASK_RTC_SSRL_SS7        0x80

#define MASK_RTC_SSRH_SS8        0x01
#define MASK_RTC_SSRH_SS9        0x02
#define MASK_RTC_SSRH_SS10       0x04
#define MASK_RTC_SSRH_SS11       0x08
#define MASK_RTC_SSRH_SS12       0x10
#define MASK_RTC_SSRH_SS13       0x20
#define MASK_RTC_SSRH_SS14       0x40
#define MASK_RTC_SSRH_SS15       0x80

#define MASK_RTC_WPR_KEY0        0x01
#define MASK_RTC_WPR_KEY1        0x02
#define MASK_RTC_WPR_KEY2        0x04
#define MASK_RTC_WPR_KEY3        0x08
#define MASK_RTC_WPR_KEY4        0x10
#define MASK_RTC_WPR_KEY5        0x20
#define MASK_RTC_WPR_KEY6        0x40
#define MASK_RTC_WPR_KEY7        0x80

#define MASK_RTC_SHIFTRH_SUBFS8  0x01
#define MASK_RTC_SHIFTRH_SUBFS9  0x02
#define MASK_RTC_SHIFTRH_SUBFS10 0x04
#define MASK_RTC_SHIFTRH_SUBFS11 0x08
#define MASK_RTC_SHIFTRH_SUBFS12 0x10
#define MASK_RTC_SHIFTRH_SUBFS13 0x20
#define MASK_RTC_SHIFTRH_SUBFS14 0x40
#define MASK_RTC_SHIFTRH_ADDIS   0x80

#define MASK_RTC_SHIFTRL_SUBFS0  0x01
#define MASK_RTC_SHIFTRL_SUBFS1  0x02
#define MASK_RTC_SHIFTRL_SUBFS2  0x04
#define MASK_RTC_SHIFTRL_SUBFS3  0x08
#define MASK_RTC_SHIFTRL_SUBFS4  0x10
#define MASK_RTC_SHIFTRL_SUBFS5  0x20
#define MASK_RTC_SHIFTRL_SUBFS6  0x40
#define MASK_RTC_SHIFTRL_SUBFS7  0x80

#define MASK_RTC_ALRMAR1_ALSU    0x0F
#define MASK_RTC_ALRMAR1_ALST    0x70
#define MASK_RTC_ALRMAR1_MSK1    0x80

#define MASK_RTC_ALRMAR2_ALMNU   0x0F
#define MASK_RTC_ALRMAR2_ALMNT   0x70
#define MASK_RTC_ALRMAR2_MSK2    0x80

#define MASK_RTC_ALRMAR3_ALHU    0x0F
#define MASK_RTC_ALRMAR3_ALHT    0x30
#define MASK_RTC_ALRMAR3_PM      0x40
#define MASK_RTC_ALRMAR3_MSK3    0x80

#define MASK_RTC_ALRMAR4_ALDU    0x0F
#define MASK_RTC_ALRMAR4_ALDT    0x30
#define MASK_RTC_ALRMAR4_WDSEL   0x40
#define MASK_RTC_ALRMAR4_MSK4    0x80

#define MASK_RTC_ALRMASSRH_ALSS8 0x01
#define MASK_RTC_ALRMASSRH_ALSS9 0x02
#define MASK_RTC_ALRMASSRH_ALSS10 0x04
#define MASK_RTC_ALRMASSRH_ALSS11 0x08
#define MASK_RTC_ALRMASSRH_ALSS12 0x10
#define MASK_RTC_ALRMASSRH_ALSS13 0x20
#define MASK_RTC_ALRMASSRH_ALSS14 0x40

#define MASK_RTC_ALRMASSRL_ALSS0 0x01
#define MASK_RTC_ALRMASSRL_ALSS1 0x02
#define MASK_RTC_ALRMASSRL_ALSS2 0x04
#define MASK_RTC_ALRMASSRL_ALSS3 0x08
#define MASK_RTC_ALRMASSRL_ALSS4 0x10
#define MASK_RTC_ALRMASSRL_ALSS5 0x20
#define MASK_RTC_ALRMASSRL_ALSS6 0x40
#define MASK_RTC_ALRMASSRL_ALSS7 0x80

#define MASK_RTC_ALRMASSMSKR_MASKSS0 0x01
#define MASK_RTC_ALRMASSMSKR_MASKSS1 0x02
#define MASK_RTC_ALRMASSMSKR_MASKSS2 0x04
#define MASK_RTC_ALRMASSMSKR_MASKSS3 0x08

#define MASK_RTC_CALRH_CALM8     0x01
#define MASK_RTC_CALRH_CALW16    0x20
#define MASK_RTC_CALRH_CALW8     0x40
#define MASK_RTC_CALRH_CALP      0x80

#define MASK_RTC_CALRL_CALM0     0x01
#define MASK_RTC_CALRL_CALM1     0x02
#define MASK_RTC_CALRL_CALM2     0x04
#define MASK_RTC_CALRL_CALM3     0x08
#define MASK_RTC_CALRL_CALM4     0x10
#define MASK_RTC_CALRL_CALM5     0x20
#define MASK_RTC_CALRL_CALM6     0x40
#define MASK_RTC_CALRL_CALM7     0x80

#define MASK_RTC_TCR1_TAMPIE     0x01
#define MASK_RTC_TCR1_TAMP1E     0x02
#define MASK_RTC_TCR1_TAMP1LEVEL 0x04
#define MASK_RTC_TCR1_TAMP2E     0x08
#define MASK_RTC_TCR1_TAMP2LEVEL 0x10
#define MASK_RTC_TCR1_TAMP3E     0x20
#define MASK_RTC_TCR1_TAMP3LEVEL 0x40

#define MASK_RTC_TCR2_TAMPFREQ   0x07
#define MASK_RTC_TCR2_TAMPFLT    0x18
#define MASK_RTC_TCR2_TAMPPRCH   0x60
#define MASK_RTC_TCR2_TAMPPUDIS  0x80

#define MASK_CSS_LSE_CSR_CSSEN   0x01
#define MASK_CSS_LSE_CSR_SWITCHEN 0x02
#define MASK_CSS_LSE_CSR_CSSIE   0x04
#define MASK_CSS_LSE_CSR_CSSF    0x08
#define MASK_CSS_LSE_CSR_SWITCHF 0x10


/*-------------------------------------------------------------------------
 *      AES register definitions
 *-----------------------------------------------------------------------*/
/* AES control register 0x00 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char EN          : 1;
  unsigned char MODE        : 2;
  unsigned char CCFC        : 1;
  unsigned char ERRFC       : 1;
  unsigned char CCIE        : 1;
  unsigned char ERRIE       : 1;
  unsigned char DMAEN       : 1;
} __BITS_AES_CR;
#endif
__IO_REG8_BIT(AES_CR,      0x51D0, __READ_WRITE, __BITS_AES_CR);

/* AES status register 0x00 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCF         : 1;
  unsigned char RDERR       : 1;
  unsigned char WRERR       : 1;
} __BITS_AES_SR;
#endif
__IO_REG8_BIT(AES_SR,      0x51D1, __READ, __BITS_AES_SR);

