yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162m8.h
/* I2C1 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char START       : 1;
  unsigned char STOP        : 1;
  unsigned char ACK         : 1;
  unsigned char POS         : 1;
  unsigned char PEC         : 1;
  unsigned char ALERT       : 1;
  unsigned char             : 1;
  unsigned char SWRST       : 1;
} __BITS_I2C1_CR2;
#endif
__IO_REG8_BIT(I2C1_CR2,    0x5211, __READ_WRITE, __BITS_I2C1_CR2);

/* I2C1 frequency register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char FREQ        : 6;
} __BITS_I2C1_FREQR;
#endif
__IO_REG8_BIT(I2C1_FREQR,  0x5212, __READ_WRITE, __BITS_I2C1_FREQR);

/* I2C1 own address register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD0        : 1;
  unsigned char ADD1        : 1;
  unsigned char ADD2        : 1;
  unsigned char ADD3        : 1;
  unsigned char ADD4        : 1;
  unsigned char ADD5        : 1;
  unsigned char ADD6        : 1;
  unsigned char ADD7        : 1;
} __BITS_I2C1_OARL;
#endif
__IO_REG8_BIT(I2C1_OARL,   0x5213, __READ_WRITE, __BITS_I2C1_OARL);

/* I2C1 own address register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char ADD8        : 1;
  unsigned char ADD9        : 1;
  unsigned char             : 3;
  unsigned char ADDCONF     : 1;
  unsigned char ADDMODE     : 1;
} __BITS_I2C1_OARH;
#endif
__IO_REG8_BIT(I2C1_OARH,   0x5214, __READ_WRITE, __BITS_I2C1_OARH);

/* I2C1 own address register for dual mode */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ENDUAL      : 1;
  unsigned char ADD21       : 1;
  unsigned char ADD22       : 1;
  unsigned char ADD23       : 1;
  unsigned char ADD24       : 1;
  unsigned char ADD25       : 1;
  unsigned char ADD26       : 1;
  unsigned char ADD27       : 1;
} __BITS_I2C1_OAR2;
#endif
__IO_REG8_BIT(I2C1_OAR2,   0x5215, __READ_WRITE, __BITS_I2C1_OAR2);

/* I2C1 data register */
__IO_REG8    (I2C1_DR,     0x5216, __READ_WRITE);
/* I2C1 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SB          : 1;
  unsigned char ADDR        : 1;
  unsigned char BTF         : 1;
  unsigned char ADD10       : 1;
  unsigned char STOPF       : 1;
  unsigned char             : 1;
  unsigned char RXNE        : 1;
  unsigned char TXE         : 1;
} __BITS_I2C1_SR1;
#endif
__IO_REG8_BIT(I2C1_SR1,    0x5217, __READ, __BITS_I2C1_SR1);

/* I2C1 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BERR        : 1;
  unsigned char ARLO        : 1;
  unsigned char AF          : 1;
  unsigned char OVR         : 1;
  unsigned char PECERR      : 1;
  unsigned char WUFH        : 1;
  unsigned char TIMEOUT     : 1;
  unsigned char SMBALERT    : 1;
} __BITS_I2C1_SR2;
#endif
__IO_REG8_BIT(I2C1_SR2,    0x5218, __READ_WRITE, __BITS_I2C1_SR2);

/* I2C1 status register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char MSL         : 1;
  unsigned char BUSY        : 1;
  unsigned char TRA         : 1;
  unsigned char             : 1;
  unsigned char GENCALL     : 1;
  unsigned char SMBDEFAULT  : 1;
  unsigned char SMBHOST     : 1;
} __BITS_I2C1_SR3;
#endif
__IO_REG8_BIT(I2C1_SR3,    0x5219, __READ, __BITS_I2C1_SR3);

/* I2C1 interrupt control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ITERREN     : 1;
  unsigned char ITEVTEN     : 1;
  unsigned char ITBUFEN     : 1;
  unsigned char DMAEN       : 1;
  unsigned char LAST        : 1;
} __BITS_I2C1_ITR;
#endif
__IO_REG8_BIT(I2C1_ITR,    0x521A, __READ_WRITE, __BITS_I2C1_ITR);

/* I2C1 clock control register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR0        : 1;
  unsigned char CCR1        : 1;
  unsigned char CCR2        : 1;
  unsigned char CCR3        : 1;
  unsigned char CCR4        : 1;
  unsigned char CCR5        : 1;
  unsigned char CCR6        : 1;
  unsigned char CCR7        : 1;
} __BITS_I2C1_CCRL;
#endif
__IO_REG8_BIT(I2C1_CCRL,   0x521B, __READ_WRITE, __BITS_I2C1_CCRL);

/* I2C1 clock control register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR8        : 1;
  unsigned char CCR9        : 1;
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char             : 2;
  unsigned char DUTY        : 1;
  unsigned char F_S         : 1;
} __BITS_I2C1_CCRH;
#endif
__IO_REG8_BIT(I2C1_CCRH,   0x521C, __READ_WRITE, __BITS_I2C1_CCRH);

/* I2C1 TRISE register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRISE       : 6;
} __BITS_I2C1_TRISER;
#endif
__IO_REG8_BIT(I2C1_TRISER, 0x521D, __READ_WRITE, __BITS_I2C1_TRISER);

/* I2C1 packet error checking register */
__IO_REG8    (I2C1_PECR,   0x521E, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      I2C1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define I2C1_CR1_PE              I2C1_CR1_bit.PE
#define I2C1_CR1_SMBUS           I2C1_CR1_bit.SMBUS
#define I2C1_CR1_SMBTYPE         I2C1_CR1_bit.SMBTYPE
#define I2C1_CR1_ENARP           I2C1_CR1_bit.ENARP
#define I2C1_CR1_ENPEC           I2C1_CR1_bit.ENPEC
#define I2C1_CR1_ENGC            I2C1_CR1_bit.ENGC
#define I2C1_CR1_NOSTRETCH       I2C1_CR1_bit.NOSTRETCH

#define I2C1_CR2_START           I2C1_CR2_bit.START
#define I2C1_CR2_STOP            I2C1_CR2_bit.STOP
#define I2C1_CR2_ACK             I2C1_CR2_bit.ACK
#define I2C1_CR2_POS             I2C1_CR2_bit.POS
#define I2C1_CR2_PEC             I2C1_CR2_bit.PEC
#define I2C1_CR2_ALERT           I2C1_CR2_bit.ALERT
#define I2C1_CR2_SWRST           I2C1_CR2_bit.SWRST

#define I2C1_FREQR_FREQ          I2C1_FREQR_bit.FREQ

#define I2C1_OARL_ADD0           I2C1_OARL_bit.ADD0
#define I2C1_OARL_ADD1           I2C1_OARL_bit.ADD1
#define I2C1_OARL_ADD2           I2C1_OARL_bit.ADD2
#define I2C1_OARL_ADD3           I2C1_OARL_bit.ADD3
#define I2C1_OARL_ADD4           I2C1_OARL_bit.ADD4
#define I2C1_OARL_ADD5           I2C1_OARL_bit.ADD5
#define I2C1_OARL_ADD6           I2C1_OARL_bit.ADD6
#define I2C1_OARL_ADD7           I2C1_OARL_bit.ADD7

#define I2C1_OARH_ADD8           I2C1_OARH_bit.ADD8
#define I2C1_OARH_ADD9           I2C1_OARH_bit.ADD9
#define I2C1_OARH_ADDCONF        I2C1_OARH_bit.ADDCONF
#define I2C1_OARH_ADDMODE        I2C1_OARH_bit.ADDMODE

#define I2C1_OAR2_ENDUAL         I2C1_OAR2_bit.ENDUAL
#define I2C1_OAR2_ADD21          I2C1_OAR2_bit.ADD21
#define I2C1_OAR2_ADD22          I2C1_OAR2_bit.ADD22
#define I2C1_OAR2_ADD23          I2C1_OAR2_bit.ADD23
#define I2C1_OAR2_ADD24          I2C1_OAR2_bit.ADD24
#define I2C1_OAR2_ADD25          I2C1_OAR2_bit.ADD25
#define I2C1_OAR2_ADD26          I2C1_OAR2_bit.ADD26
#define I2C1_OAR2_ADD27          I2C1_OAR2_bit.ADD27

#define I2C1_SR1_SB              I2C1_SR1_bit.SB
#define I2C1_SR1_ADDR            I2C1_SR1_bit.ADDR
#define I2C1_SR1_BTF             I2C1_SR1_bit.BTF
#define I2C1_SR1_ADD10           I2C1_SR1_bit.ADD10
#define I2C1_SR1_STOPF           I2C1_SR1_bit.STOPF
#define I2C1_SR1_RXNE            I2C1_SR1_bit.RXNE
#define I2C1_SR1_TXE             I2C1_SR1_bit.TXE

#define I2C1_SR2_BERR            I2C1_SR2_bit.BERR
#define I2C1_SR2_ARLO            I2C1_SR2_bit.ARLO
#define I2C1_SR2_AF              I2C1_SR2_bit.AF
#define I2C1_SR2_OVR             I2C1_SR2_bit.OVR
#define I2C1_SR2_PECERR          I2C1_SR2_bit.PECERR
#define I2C1_SR2_WUFH            I2C1_SR2_bit.WUFH
#define I2C1_SR2_TIMEOUT         I2C1_SR2_bit.TIMEOUT
#define I2C1_SR2_SMBALERT        I2C1_SR2_bit.SMBALERT

#define I2C1_SR3_MSL             I2C1_SR3_bit.MSL
#define I2C1_SR3_BUSY            I2C1_SR3_bit.BUSY
#define I2C1_SR3_TRA             I2C1_SR3_bit.TRA
#define I2C1_SR3_GENCALL         I2C1_SR3_bit.GENCALL
#define I2C1_SR3_SMBDEFAULT      I2C1_SR3_bit.SMBDEFAULT
#define I2C1_SR3_SMBHOST         I2C1_SR3_bit.SMBHOST

#define I2C1_ITR_ITERREN         I2C1_ITR_bit.ITERREN
#define I2C1_ITR_ITEVTEN         I2C1_ITR_bit.ITEVTEN
#define I2C1_ITR_ITBUFEN         I2C1_ITR_bit.ITBUFEN
#define I2C1_ITR_DMAEN           I2C1_ITR_bit.DMAEN
#define I2C1_ITR_LAST            I2C1_ITR_bit.LAST

