yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162m8.h
#define TIM5_DER_UDE             TIM5_DER_bit.UDE
#define TIM5_DER_CC1DE           TIM5_DER_bit.CC1DE
#define TIM5_DER_CC2DE           TIM5_DER_bit.CC2DE

#define TIM5_IER_UIE             TIM5_IER_bit.UIE
#define TIM5_IER_CC1IE           TIM5_IER_bit.CC1IE
#define TIM5_IER_CC2IE           TIM5_IER_bit.CC2IE
#define TIM5_IER_TIE             TIM5_IER_bit.TIE
#define TIM5_IER_BIE             TIM5_IER_bit.BIE

#define TIM5_SR1_UIF             TIM5_SR1_bit.UIF
#define TIM5_SR1_CC1IF           TIM5_SR1_bit.CC1IF
#define TIM5_SR1_CC2IF           TIM5_SR1_bit.CC2IF
#define TIM5_SR1_TIF             TIM5_SR1_bit.TIF
#define TIM5_SR1_BIF             TIM5_SR1_bit.BIF

#define TIM5_SR2_CC1OF           TIM5_SR2_bit.CC1OF
#define TIM5_SR2_CC2OF           TIM5_SR2_bit.CC2OF

#define TIM5_EGR_UG              TIM5_EGR_bit.UG
#define TIM5_EGR_CC1G            TIM5_EGR_bit.CC1G
#define TIM5_EGR_CC2G            TIM5_EGR_bit.CC2G
#define TIM5_EGR_TG              TIM5_EGR_bit.TG
#define TIM5_EGR_BG              TIM5_EGR_bit.BG

#define TIM5_CCMR1_CC1S          TIM5_CCMR1_bit.CC1S
#define TIM5_CCMR1_OC1FE         TIM5_CCMR1_bit.OC1FE
#define TIM5_CCMR1_OC1PE         TIM5_CCMR1_bit.OC1PE
#define TIM5_CCMR1_OC1M          TIM5_CCMR1_bit.OC1M

#define TIM5_CCMR2_CC2S          TIM5_CCMR2_bit.CC2S
#define TIM5_CCMR2_OC2FE         TIM5_CCMR2_bit.OC2FE
#define TIM5_CCMR2_OC2PE         TIM5_CCMR2_bit.OC2PE
#define TIM5_CCMR2_OC2M          TIM5_CCMR2_bit.OC2M

#define TIM5_CCER1_CC1E          TIM5_CCER1_bit.CC1E
#define TIM5_CCER1_CC1P          TIM5_CCER1_bit.CC1P
#define TIM5_CCER1_CC2E          TIM5_CCER1_bit.CC2E
#define TIM5_CCER1_CC2P          TIM5_CCER1_bit.CC2P

#define TIM5_CNTRH_CNT8          TIM5_CNTRH_bit.CNT8
#define TIM5_CNTRH_CNT9          TIM5_CNTRH_bit.CNT9
#define TIM5_CNTRH_CNT10         TIM5_CNTRH_bit.CNT10
#define TIM5_CNTRH_CNT11         TIM5_CNTRH_bit.CNT11
#define TIM5_CNTRH_CNT12         TIM5_CNTRH_bit.CNT12
#define TIM5_CNTRH_CNT13         TIM5_CNTRH_bit.CNT13
#define TIM5_CNTRH_CNT14         TIM5_CNTRH_bit.CNT14
#define TIM5_CNTRH_CNT15         TIM5_CNTRH_bit.CNT15

#define TIM5_CNTRL_CNT0          TIM5_CNTRL_bit.CNT0
#define TIM5_CNTRL_CNT1          TIM5_CNTRL_bit.CNT1
#define TIM5_CNTRL_CNT2          TIM5_CNTRL_bit.CNT2
#define TIM5_CNTRL_CNT3          TIM5_CNTRL_bit.CNT3
#define TIM5_CNTRL_CNT4          TIM5_CNTRL_bit.CNT4
#define TIM5_CNTRL_CNT5          TIM5_CNTRL_bit.CNT5
#define TIM5_CNTRL_CNT6          TIM5_CNTRL_bit.CNT6
#define TIM5_CNTRL_CNT7          TIM5_CNTRL_bit.CNT7

#define TIM5_PSCR_PSC            TIM5_PSCR_bit.PSC

#define TIM5_ARRH_ARR8           TIM5_ARRH_bit.ARR8
#define TIM5_ARRH_ARR9           TIM5_ARRH_bit.ARR9
#define TIM5_ARRH_ARR10          TIM5_ARRH_bit.ARR10
#define TIM5_ARRH_ARR11          TIM5_ARRH_bit.ARR11
#define TIM5_ARRH_ARR12          TIM5_ARRH_bit.ARR12
#define TIM5_ARRH_ARR13          TIM5_ARRH_bit.ARR13
#define TIM5_ARRH_ARR14          TIM5_ARRH_bit.ARR14
#define TIM5_ARRH_ARR15          TIM5_ARRH_bit.ARR15

#define TIM5_ARRL_ARR0           TIM5_ARRL_bit.ARR0
#define TIM5_ARRL_ARR1           TIM5_ARRL_bit.ARR1
#define TIM5_ARRL_ARR2           TIM5_ARRL_bit.ARR2
#define TIM5_ARRL_ARR3           TIM5_ARRL_bit.ARR3
#define TIM5_ARRL_ARR4           TIM5_ARRL_bit.ARR4
#define TIM5_ARRL_ARR5           TIM5_ARRL_bit.ARR5
#define TIM5_ARRL_ARR6           TIM5_ARRL_bit.ARR6
#define TIM5_ARRL_ARR7           TIM5_ARRL_bit.ARR7

#define TIM5_CCR1H_CCR18         TIM5_CCR1H_bit.CCR18
#define TIM5_CCR1H_CCR19         TIM5_CCR1H_bit.CCR19
#define TIM5_CCR1H_CCR110        TIM5_CCR1H_bit.CCR110
#define TIM5_CCR1H_CCR111        TIM5_CCR1H_bit.CCR111
#define TIM5_CCR1H_CCR112        TIM5_CCR1H_bit.CCR112
#define TIM5_CCR1H_CCR113        TIM5_CCR1H_bit.CCR113
#define TIM5_CCR1H_CCR114        TIM5_CCR1H_bit.CCR114
#define TIM5_CCR1H_CCR115        TIM5_CCR1H_bit.CCR115

#define TIM5_CCR1L_CCR10         TIM5_CCR1L_bit.CCR10
#define TIM5_CCR1L_CCR11         TIM5_CCR1L_bit.CCR11
#define TIM5_CCR1L_CCR12         TIM5_CCR1L_bit.CCR12
#define TIM5_CCR1L_CCR13         TIM5_CCR1L_bit.CCR13
#define TIM5_CCR1L_CCR14         TIM5_CCR1L_bit.CCR14
#define TIM5_CCR1L_CCR15         TIM5_CCR1L_bit.CCR15
#define TIM5_CCR1L_CCR16         TIM5_CCR1L_bit.CCR16
#define TIM5_CCR1L_CCR17         TIM5_CCR1L_bit.CCR17

#define TIM5_CCR2H_CCR28         TIM5_CCR2H_bit.CCR28
#define TIM5_CCR2H_CCR29         TIM5_CCR2H_bit.CCR29
#define TIM5_CCR2H_CCR210        TIM5_CCR2H_bit.CCR210
#define TIM5_CCR2H_CCR211        TIM5_CCR2H_bit.CCR211
#define TIM5_CCR2H_CCR212        TIM5_CCR2H_bit.CCR212
#define TIM5_CCR2H_CCR213        TIM5_CCR2H_bit.CCR213
#define TIM5_CCR2H_CCR214        TIM5_CCR2H_bit.CCR214
#define TIM5_CCR2H_CCR215        TIM5_CCR2H_bit.CCR215

#define TIM5_CCR2L_CCR10         TIM5_CCR2L_bit.CCR10
#define TIM5_CCR2L_CCR11         TIM5_CCR2L_bit.CCR11
#define TIM5_CCR2L_CCR12         TIM5_CCR2L_bit.CCR12
#define TIM5_CCR2L_CCR13         TIM5_CCR2L_bit.CCR13
#define TIM5_CCR2L_CCR14         TIM5_CCR2L_bit.CCR14
#define TIM5_CCR2L_CCR15         TIM5_CCR2L_bit.CCR15
#define TIM5_CCR2L_CCR16         TIM5_CCR2L_bit.CCR16
#define TIM5_CCR2L_CCR17         TIM5_CCR2L_bit.CCR17

#define TIM5_BKR_LOCK            TIM5_BKR_bit.LOCK
#define TIM5_BKR_OSSI            TIM5_BKR_bit.OSSI
#define TIM5_BKR_BKE             TIM5_BKR_bit.BKE
#define TIM5_BKR_BKP             TIM5_BKR_bit.BKP
#define TIM5_BKR_AOE             TIM5_BKR_bit.AOE
#define TIM5_BKR_MOE             TIM5_BKR_bit.MOE

#define TIM5_OISR_OIS1           TIM5_OISR_bit.OIS1
#define TIM5_OISR_OIS2           TIM5_OISR_bit.OIS2

#endif

/*-------------------------------------------------------------------------
 *      TIM5 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM5_CR1_CEN        0x01
#define MASK_TIM5_CR1_UDIS       0x02
#define MASK_TIM5_CR1_URS        0x04
#define MASK_TIM5_CR1_OPM        0x08
#define MASK_TIM5_CR1_DIR        0x10
#define MASK_TIM5_CR1_CMS        0x60
#define MASK_TIM5_CR1_ARPE       0x80

