yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162m8.h
#define MASK_DAC_CH2DHR8_DHR00   0x01
#define MASK_DAC_CH2DHR8_DHR10   0x02
#define MASK_DAC_CH2DHR8_DHR20   0x04
#define MASK_DAC_CH2DHR8_DHR30   0x08
#define MASK_DAC_CH2DHR8_DHR40   0x10
#define MASK_DAC_CH2DHR8_DHR50   0x20
#define MASK_DAC_CH2DHR8_DHR60   0x40
#define MASK_DAC_CH2DHR8_DHR70   0x80

#define MASK_DAC_DCH1RDHRH_RDHRH00 0x01
#define MASK_DAC_DCH1RDHRH_RDHRH10 0x02
#define MASK_DAC_DCH1RDHRH_RDHRH20 0x04
#define MASK_DAC_DCH1RDHRH_RDHRH30 0x08

#define MASK_DAC_DCH1RDHRL_RDHRL00 0x01
#define MASK_DAC_DCH1RDHRL_RDHRL10 0x02
#define MASK_DAC_DCH1RDHRL_RDHRL20 0x04
#define MASK_DAC_DCH1RDHRL_RDHRL30 0x08
#define MASK_DAC_DCH1RDHRL_RDHRL40 0x10
#define MASK_DAC_DCH1RDHRL_RDHRL50 0x20
#define MASK_DAC_DCH1RDHRL_RDHRL60 0x40
#define MASK_DAC_DCH1RDHRL_RDHRL70 0x80

#define MASK_DAC_DORH_DORH       0x0F

#define MASK_DAC_DCH2RDHRH_RDHRH00 0x01
#define MASK_DAC_DCH2RDHRH_RDHRH10 0x02
#define MASK_DAC_DCH2RDHRH_RDHRH20 0x04
#define MASK_DAC_DCH2RDHRH_RDHRH30 0x08

#define MASK_DAC_DCH2RDHRL_RDHRL00 0x01
#define MASK_DAC_DCH2RDHRL_RDHRL10 0x02
#define MASK_DAC_DCH2RDHRL_RDHRL20 0x04
#define MASK_DAC_DCH2RDHRL_RDHRL30 0x08
#define MASK_DAC_DCH2RDHRL_RDHRL40 0x10
#define MASK_DAC_DCH2RDHRL_RDHRL50 0x20
#define MASK_DAC_DCH2RDHRL_RDHRL60 0x40
#define MASK_DAC_DCH2RDHRL_RDHRL70 0x80

#define MASK_DAC_DCH1LDHRH_LDHRH00 0x01
#define MASK_DAC_DCH1LDHRH_LDHRH10 0x02
#define MASK_DAC_DCH1LDHRH_LDHRH20 0x04
#define MASK_DAC_DCH1LDHRH_LDHRH30 0x08
#define MASK_DAC_DCH1LDHRH_LDHRH40 0x10
#define MASK_DAC_DCH1LDHRH_LDHRH50 0x20
#define MASK_DAC_DCH1LDHRH_LDHRH60 0x40
#define MASK_DAC_DCH1LDHRH_LDHRH70 0x80

#define MASK_DAC_DCH1LDHRL_LDHRL40 0x10
#define MASK_DAC_DCH1LDHRL_LDHRL50 0x20
#define MASK_DAC_DCH1LDHRL_LDHRL60 0x40
#define MASK_DAC_DCH1LDHRL_LDHRL70 0x80

#define MASK_DAC_DCH2LDHRH_LDHRH00 0x01
#define MASK_DAC_DCH2LDHRH_LDHRH10 0x02
#define MASK_DAC_DCH2LDHRH_LDHRH20 0x04
#define MASK_DAC_DCH2LDHRH_LDHRH30 0x08
#define MASK_DAC_DCH2LDHRH_LDHRH40 0x10
#define MASK_DAC_DCH2LDHRH_LDHRH50 0x20
#define MASK_DAC_DCH2LDHRH_LDHRH60 0x40
#define MASK_DAC_DCH2LDHRH_LDHRH70 0x80

#define MASK_DAC_DCH2LDHRL_LDHRL40 0x10
#define MASK_DAC_DCH2LDHRL_LDHRL50 0x20
#define MASK_DAC_DCH2LDHRL_LDHRL60 0x40
#define MASK_DAC_DCH2LDHRL_LDHRL70 0x80

#define MASK_DAC_DCH1DHR8_DHR00  0x01
#define MASK_DAC_DCH1DHR8_DHR10  0x02
#define MASK_DAC_DCH1DHR8_DHR20  0x04
#define MASK_DAC_DCH1DHR8_DHR30  0x08
#define MASK_DAC_DCH1DHR8_DHR40  0x10
#define MASK_DAC_DCH1DHR8_DHR50  0x20
#define MASK_DAC_DCH1DHR8_DHR60  0x40
#define MASK_DAC_DCH1DHR8_DHR70  0x80

#define MASK_DAC_DCH2DHR8_DHR00  0x01
#define MASK_DAC_DCH2DHR8_DHR10  0x02
#define MASK_DAC_DCH2DHR8_DHR20  0x04
#define MASK_DAC_DCH2DHR8_DHR30  0x08
#define MASK_DAC_DCH2DHR8_DHR40  0x10
#define MASK_DAC_DCH2DHR8_DHR50  0x20
#define MASK_DAC_DCH2DHR8_DHR60  0x40
#define MASK_DAC_DCH2DHR8_DHR70  0x80

#define MASK_DAC_CH1DORH_DORH00  0x01
#define MASK_DAC_CH1DORH_DORH10  0x02
#define MASK_DAC_CH1DORH_DORH20  0x04
#define MASK_DAC_CH1DORH_DORH30  0x08

#define MASK_DAC_CH1DORL_DORL00  0x01
#define MASK_DAC_CH1DORL_DORL10  0x02
#define MASK_DAC_CH1DORL_DORL20  0x04
#define MASK_DAC_CH1DORL_DORL30  0x08
#define MASK_DAC_CH1DORL_DORL40  0x10
#define MASK_DAC_CH1DORL_DORL50  0x20
#define MASK_DAC_CH1DORL_DORL60  0x40
#define MASK_DAC_CH1DORL_DORL70  0x80

#define MASK_DAC_CH2DORH_DORH00  0x01
#define MASK_DAC_CH2DORH_DORH10  0x02
#define MASK_DAC_CH2DORH_DORH20  0x04
#define MASK_DAC_CH2DORH_DORH30  0x08

#define MASK_DAC_CH2DORL_DORL00  0x01
#define MASK_DAC_CH2DORL_DORL10  0x02
#define MASK_DAC_CH2DORL_DORL20  0x04
#define MASK_DAC_CH2DORL_DORL30  0x08
#define MASK_DAC_CH2DORL_DORL40  0x10
#define MASK_DAC_CH2DORL_DORL50  0x20
#define MASK_DAC_CH2DORL_DORL60  0x40
#define MASK_DAC_CH2DORL_DORL70  0x80


/*-------------------------------------------------------------------------
 *      SPI2 register definitions
 *-----------------------------------------------------------------------*/
/* SPI2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char MSTR        : 1;
  unsigned char BR          : 3;
  unsigned char SPE         : 1;
  unsigned char LSBFIRST    : 1;
} __BITS_SPI2_CR1;
#endif
__IO_REG8_BIT(SPI2_CR1,    0x53C0, __READ_WRITE, __BITS_SPI2_CR1);

/* SPI2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SSI         : 1;
  unsigned char SSM         : 1;
  unsigned char RXONLY      : 1;
  unsigned char             : 1;
  unsigned char CRCNEXT     : 1;
  unsigned char CRCEN       : 1;
  unsigned char BDOE        : 1;
  unsigned char BDM         : 1;
} __BITS_SPI2_CR2;
#endif
__IO_REG8_BIT(SPI2_CR2,    0x53C1, __READ_WRITE, __BITS_SPI2_CR2);

/* SPI2 interrupt control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXDMAEN     : 1;
  unsigned char TXDMAEN     : 1;
  unsigned char             : 2;
  unsigned char WKIE        : 1;
  unsigned char ERRIE       : 1;
  unsigned char RXIE        : 1;
  unsigned char TXIE        : 1;
} __BITS_SPI2_ICR;
#endif
__IO_REG8_BIT(SPI2_ICR,    0x53C2, __READ_WRITE, __BITS_SPI2_ICR);

/* SPI2 status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char RXNE        : 1;
  unsigned char TXE         : 1;
  unsigned char             : 1;
  unsigned char WKUP        : 1;
  unsigned char CRCERR      : 1;
  unsigned char MODF        : 1;
  unsigned char OVR         : 1;
  unsigned char BSY         : 1;
} __BITS_SPI2_SR;
#endif
__IO_REG8_BIT(SPI2_SR,     0x53C3, __READ_WRITE, __BITS_SPI2_SR);

/* SPI2 data register */
__IO_REG8    (SPI2_DR,     0x53C4, __READ_WRITE);
/* SPI2 CRC polynomial register */
__IO_REG8    (SPI2_CRCPR,  0x53C5, __READ_WRITE);
/* SPI2 Rx CRC register */
__IO_REG8    (SPI2_RXCRCR, 0x53C6, __READ);
/* SPI2 Tx CRC register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TXCRC       : 7;
} __BITS_SPI2_TXCRCR;
#endif
__IO_REG8_BIT(SPI2_TXCRCR, 0x53C7, __READ, __BITS_SPI2_TXCRCR);


/*-------------------------------------------------------------------------
 *      SPI2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define SPI2_CR1_CPHA            SPI2_CR1_bit.CPHA
#define SPI2_CR1_CPOL            SPI2_CR1_bit.CPOL
#define SPI2_CR1_MSTR            SPI2_CR1_bit.MSTR
#define SPI2_CR1_BR              SPI2_CR1_bit.BR
#define SPI2_CR1_SPE             SPI2_CR1_bit.SPE
#define SPI2_CR1_LSBFIRST        SPI2_CR1_bit.LSBFIRST

#define SPI2_CR2_SSI             SPI2_CR2_bit.SSI
#define SPI2_CR2_SSM             SPI2_CR2_bit.SSM
#define SPI2_CR2_RXONLY          SPI2_CR2_bit.RXONLY
#define SPI2_CR2_CRCNEXT         SPI2_CR2_bit.CRCNEXT
#define SPI2_CR2_CRCEN           SPI2_CR2_bit.CRCEN
#define SPI2_CR2_BDOE            SPI2_CR2_bit.BDOE
#define SPI2_CR2_BDM             SPI2_CR2_bit.BDM

#define SPI2_ICR_RXDMAEN         SPI2_ICR_bit.RXDMAEN
#define SPI2_ICR_TXDMAEN         SPI2_ICR_bit.TXDMAEN
#define SPI2_ICR_WKIE            SPI2_ICR_bit.WKIE
#define SPI2_ICR_ERRIE           SPI2_ICR_bit.ERRIE
#define SPI2_ICR_RXIE            SPI2_ICR_bit.RXIE
#define SPI2_ICR_TXIE            SPI2_ICR_bit.TXIE

#define SPI2_SR_RXNE             SPI2_SR_bit.RXNE
#define SPI2_SR_TXE              SPI2_SR_bit.TXE
#define SPI2_SR_WKUP             SPI2_SR_bit.WKUP
#define SPI2_SR_CRCERR           SPI2_SR_bit.CRCERR
#define SPI2_SR_MODF             SPI2_SR_bit.MODF
#define SPI2_SR_OVR              SPI2_SR_bit.OVR
#define SPI2_SR_BSY              SPI2_SR_bit.BSY

#define SPI2_TXCRCR_TXCRC        SPI2_TXCRCR_bit.TXCRC

#endif

/*-------------------------------------------------------------------------
 *      SPI2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_SPI2_CR1_CPHA       0x01
#define MASK_SPI2_CR1_CPOL       0x02
#define MASK_SPI2_CR1_MSTR       0x04
#define MASK_SPI2_CR1_BR         0x38
#define MASK_SPI2_CR1_SPE        0x40
#define MASK_SPI2_CR1_LSBFIRST   0x80

