yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l162m8.h
#define MASK_RI_IOSR1_CH1E       0x01
#define MASK_RI_IOSR1_CH4E       0x02
#define MASK_RI_IOSR1_CH7E       0x04
#define MASK_RI_IOSR1_CH10E      0x08
#define MASK_RI_IOSR1_CH13E      0x10
#define MASK_RI_IOSR1_CH16E      0x20
#define MASK_RI_IOSR1_CH19E      0x40
#define MASK_RI_IOSR1_CH22E      0x80

#define MASK_RI_IOSR2_CH2E       0x01
#define MASK_RI_IOSR2_CH5E       0x02
#define MASK_RI_IOSR2_CH8E       0x04
#define MASK_RI_IOSR2_CH11E      0x08
#define MASK_RI_IOSR2_CH14E      0x10
#define MASK_RI_IOSR2_CH17E      0x20
#define MASK_RI_IOSR2_CH20E      0x40
#define MASK_RI_IOSR2_CH23E      0x80

#define MASK_RI_IOSR3_CH3E       0x01
#define MASK_RI_IOSR3_CH6E       0x02
#define MASK_RI_IOSR3_CH9E       0x04
#define MASK_RI_IOSR3_CH12E      0x08
#define MASK_RI_IOSR3_CH15E      0x10
#define MASK_RI_IOSR3_CH18E      0x20
#define MASK_RI_IOSR3_CH21E      0x40
#define MASK_RI_IOSR3_CH24E      0x80

#define MASK_RI_IOGCR_IOM1       0x03
#define MASK_RI_IOGCR_IOM2       0x0C
#define MASK_RI_IOGCR_IOM3       0x30

#define MASK_RI_ASCR1_AS0        0x01
#define MASK_RI_ASCR1_AS1        0x02
#define MASK_RI_ASCR1_AS2        0x04
#define MASK_RI_ASCR1_AS3        0x08
#define MASK_RI_ASCR1_AS4        0x10
#define MASK_RI_ASCR1_AS5        0x20
#define MASK_RI_ASCR1_AS6        0x40
#define MASK_RI_ASCR1_AS7        0x80

#define MASK_RI_ASCR2_AS8        0x01
#define MASK_RI_ASCR2_AS14       0x40

#define MASK_RI_RCR_KPU10        0x01
#define MASK_RI_RCR_KPU400       0x02
#define MASK_RI_RCR_KPD10        0x04
#define MASK_RI_RCR_KPD400       0x08


/*-------------------------------------------------------------------------
 *      COMP1/COMP2 register definitions
 *-----------------------------------------------------------------------*/
/* Comparator control and status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CMP1        : 2;
  unsigned char STE         : 1;
  unsigned char CMP1OUT     : 1;
  unsigned char EF1         : 1;
  unsigned char IE1         : 1;
} __BITS_COMP_CSR1;
#endif
__IO_REG8_BIT(COMP_CSR1,   0x5440, __READ_WRITE, __BITS_COMP_CSR1);

/* Comparator control and status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CMP2        : 2;
  unsigned char SPEED       : 1;
  unsigned char CMP2OUT     : 1;
  unsigned char EF2         : 1;
  unsigned char IE2         : 1;
} __BITS_COMP_CSR2;
#endif
__IO_REG8_BIT(COMP_CSR2,   0x5441, __READ_WRITE, __BITS_COMP_CSR2);

/* Comparator control and status register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VREFOUTEN   : 1;
  unsigned char WNDWE       : 1;
  unsigned char VREFEN      : 1;
  unsigned char INSEL       : 3;
  unsigned char OUTSEL      : 2;
} __BITS_COMP_CSR3;
#endif
__IO_REG8_BIT(COMP_CSR3,   0x5442, __READ_WRITE, __BITS_COMP_CSR3);

/* Comparator control and status register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char INVTRIG     : 3;
  unsigned char NINVTRIG    : 3;
} __BITS_COMP_CSR4;
#endif
__IO_REG8_BIT(COMP_CSR4,   0x5443, __READ_WRITE, __BITS_COMP_CSR4);

/* Comparator control and status register 5 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char VREFTRIG    : 3;
  unsigned char DACTRIG     : 3;
} __BITS_COMP_CSR5;
#endif
__IO_REG8_BIT(COMP_CSR5,   0x5444, __READ_WRITE, __BITS_COMP_CSR5);


/*-------------------------------------------------------------------------
 *      COMP1/COMP2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define COMP_CSR1_CMP1           COMP_CSR1_bit.CMP1
#define COMP_CSR1_STE            COMP_CSR1_bit.STE
#define COMP_CSR1_CMP1OUT        COMP_CSR1_bit.CMP1OUT
#define COMP_CSR1_EF1            COMP_CSR1_bit.EF1
#define COMP_CSR1_IE1            COMP_CSR1_bit.IE1

#define COMP_CSR2_CMP2           COMP_CSR2_bit.CMP2
#define COMP_CSR2_SPEED          COMP_CSR2_bit.SPEED
#define COMP_CSR2_CMP2OUT        COMP_CSR2_bit.CMP2OUT
#define COMP_CSR2_EF2            COMP_CSR2_bit.EF2
#define COMP_CSR2_IE2            COMP_CSR2_bit.IE2

#define COMP_CSR3_VREFOUTEN      COMP_CSR3_bit.VREFOUTEN
#define COMP_CSR3_WNDWE          COMP_CSR3_bit.WNDWE
#define COMP_CSR3_VREFEN         COMP_CSR3_bit.VREFEN
#define COMP_CSR3_INSEL          COMP_CSR3_bit.INSEL
#define COMP_CSR3_OUTSEL         COMP_CSR3_bit.OUTSEL

#define COMP_CSR4_INVTRIG        COMP_CSR4_bit.INVTRIG
#define COMP_CSR4_NINVTRIG       COMP_CSR4_bit.NINVTRIG

#define COMP_CSR5_VREFTRIG       COMP_CSR5_bit.VREFTRIG
#define COMP_CSR5_DACTRIG        COMP_CSR5_bit.DACTRIG

#endif

/*-------------------------------------------------------------------------
 *      COMP1/COMP2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_COMP_CSR1_CMP1      0x03
#define MASK_COMP_CSR1_STE       0x04
#define MASK_COMP_CSR1_CMP1OUT   0x08
#define MASK_COMP_CSR1_EF1       0x10
#define MASK_COMP_CSR1_IE1       0x20

#define MASK_COMP_CSR2_CMP2      0x03
#define MASK_COMP_CSR2_SPEED     0x04
#define MASK_COMP_CSR2_CMP2OUT   0x08
#define MASK_COMP_CSR2_EF2       0x10
#define MASK_COMP_CSR2_IE2       0x20

#define MASK_COMP_CSR3_VREFOUTEN 0x01
#define MASK_COMP_CSR3_WNDWE     0x02
#define MASK_COMP_CSR3_VREFEN    0x04
#define MASK_COMP_CSR3_INSEL     0x38
#define MASK_COMP_CSR3_OUTSEL    0xC0

#define MASK_COMP_CSR4_INVTRIG   0x07
#define MASK_COMP_CSR4_NINVTRIG  0x38

#define MASK_COMP_CSR5_VREFTRIG  0x07
#define MASK_COMP_CSR5_DACTRIG   0x38


/*-------------------------------------------------------------------------
 *      CPU register definitions
 *-----------------------------------------------------------------------*/
/* Accumulator */
__IO_REG8    (CPU_A,       0x7F00, __READ_WRITE);
/* Program counter extended */
__IO_REG8    (CPU_PCE,     0x7F01, __READ_WRITE);
/* Program counter high */
__IO_REG8    (CPU_PCH,     0x7F02, __READ_WRITE);
/* Program counter low */
__IO_REG8    (CPU_PCL,     0x7F03, __READ_WRITE);
/* X index register high */
__IO_REG8    (CPU_XH,      0x7F04, __READ_WRITE);
/* X index register low */
__IO_REG8    (CPU_XL,      0x7F05, __READ_WRITE);
/* Y index register high */
__IO_REG8    (CPU_YH,      0x7F06, __READ_WRITE);
/* Y index register low */
__IO_REG8    (CPU_YL,      0x7F07, __READ_WRITE);
/* Stack pointer high */
__IO_REG8    (CPU_SPH,     0x7F08, __READ_WRITE);
/* Stack pointer low */
__IO_REG8    (CPU_SPL,     0x7F09, __READ_WRITE);
/* Condition code register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C           : 1;
  unsigned char Z           : 1;
  unsigned char N           : 1;
  unsigned char I0          : 1;
  unsigned char H           : 1;
  unsigned char I1          : 1;
  unsigned char             : 1;
  unsigned char V           : 1;
} __BITS_CPU_CCR;
#endif
__IO_REG8_BIT(CPU_CCR,     0x7F0A, __READ_WRITE, __BITS_CPU_CCR);

